Diplom_5/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтавкаЧаса</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
</mdclass:Catalog>

Diplom_5/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_Абонент</name>
  </enumValues>
</mdclass:Enum>

Diplom_5/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

//В задани написанно:
//Примечание: не забудьте, что изменения формы реализуются программно, новые объекты и методы добавляются с префиксом.
//Но на созданные формы это же не распростроняется? Даже если 1с создаст форму для элемента, 
//то врятли она хоть как-то будет стыковаться с созданной нами 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ВидимостьДополнительныхЭлементов();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьДополнительныхЭлементов();
	
КонецПроцедуры 

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидимостьДополнительныхЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидимостьДополнительныхЭлементов()
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_Абонент") Тогда
		Элементы.ПериодДействия.Видимость = Истина;
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Истина;
		Элементы.ВКМ_СтавкаЧаса.Видимость = Истина;
	Иначе
		Элементы.ПериодДействия.Видимость = Ложь;
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Ложь;
		Элементы.ВКМ_СтавкаЧаса.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
